# Getting and Knowing Data

In [2]:
import pandas as pd
import numpy as np

In [ ]:
##Buoc 1: Import Dataset

In [7]:
df = pd.read_csv("chipotle.tsv", sep = "\t")

In [8]:
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [9]:
## Step2: Dataset Overview

In [10]:
df.shape

(4622, 5)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [13]:
#print all columns name
list(df.columns)

['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

In [15]:
df.index

RangeIndex(start=0, stop=4622, step=1)

In [17]:
df.describe(include = "all")

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

In [18]:
### loc vs iloc (Vi tri và Vị trí theo index)

In [19]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [29]:
# chọn hàng với nhiều điều kiện khác nhau
df.loc[(df.quantity >= 2) & ( df.item_name == "Nantucket Nectar"), ["order_id", "quantity", "item_name"]]

      order_id  quantity         item_name
601        247         2  Nantucket Nectar
2379       947         2  Nantucket Nectar

In [33]:
#thêm dấu [], sẽ hiện dưới dạng dataframe
df.iloc[[9]]

,order_id,quantity,item_name,choice_description,item_price
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [35]:
#iloc[] cung cấp những dãy từ hàng.. đến hàng... tùy ý
df.iloc[3:11]

,order_id,quantity,item_name,choice_description,item_price
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25
10,5,1,Chips and Guacamole,NaN,$4.45

In [38]:
#chọn những cột muốn chọn
X= df.iloc[3:9, :-1]
Y = df.iloc[3:9,-1]
print(Y)

3     $2.39
4    $16.98
5    $10.98
6     $1.69
7    $11.75
8     $9.25
Name: item_price, dtype: object

In [40]:
#Data manipulation (Thao tác với dữ liệu)

In [41]:
df.item_price.dtype

dtype('O')

In [42]:
#Apply()

In [64]:
df.item_price.apply(lambda x : float(x.replace('$', '')))

AttributeError: 'float' object has no attribute 'replace'

In [71]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [77]:
#tạo columns mới
df["total_price"] = df["quantity"] * df["item_price"]

In [78]:
df.head()

,order_id,quantity,item_name,choice_description,item_price,total_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

In [79]:
#Tổng doanh thu toàn bộ trong cái dataset này

In [81]:
revenue = df["total_price"].sum()
print(revenue)

39237.02

In [82]:
### item đc order nhiều nhất trong dataset

In [83]:
#Group by

In [95]:
c = df.groupby("item_name")["quantity"].sum()
c.sort_values(ascending = False).head()

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Steak Burrito          386
Canned Soft Drink      351
Name: quantity, dtype: int64

In [98]:
#unique Values (giá trị duy nhất, k bị lặp đi lặp lại)
df.item_name.value_counts().count()

50

In [99]:
df.item_name.nunique()

50